modm-ext/archive-stmicro-svd/rm_rm0432_stm32l4p5aei6.svd
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.23</name>
        <addressOffset>0x85c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.24</name>
        <addressOffset>0x860</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.25</name>
        <addressOffset>0x864</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.26</name>
        <addressOffset>0x868</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.27</name>
        <addressOffset>0x86c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.28</name>
        <addressOffset>0x870</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.29</name>
        <addressOffset>0x874</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.30</name>
        <addressOffset>0x878</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.31</name>
        <addressOffset>0x87c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.32</name>
        <addressOffset>0x880</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.33</name>
        <addressOffset>0x884</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.34</name>
        <addressOffset>0x888</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.35</name>
        <addressOffset>0x88c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.36</name>
        <addressOffset>0x890</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.37</name>
        <addressOffset>0x894</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.38</name>
        <addressOffset>0x898</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.39</name>
        <addressOffset>0x89c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.40</name>
        <addressOffset>0x8a0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.41</name>
        <addressOffset>0x8a4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.42</name>
        <addressOffset>0x8a8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.43</name>
        <addressOffset>0x8ac</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.44</name>
        <addressOffset>0x8b0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.45</name>
        <addressOffset>0x8b4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.46</name>
        <addressOffset>0x8b8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.47</name>
        <addressOffset>0x8bc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.48</name>
        <addressOffset>0x8c0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.49</name>
        <addressOffset>0x8c4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.50</name>
        <addressOffset>0x8c8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.51</name>
        <addressOffset>0x8cc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.52</name>
        <addressOffset>0x8d0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.53</name>
        <addressOffset>0x8d4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.54</name>
        <addressOffset>0x8d8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.55</name>
        <addressOffset>0x8dc</addressOffset>
        <size>0x20</size>
      </register>
