modm-ext/archive-stmicro-svd/rm_rm0432_stm32l4p5aei6.svd
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.56</name>
        <addressOffset>0x8e0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.57</name>
        <addressOffset>0x8e4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.58</name>
        <addressOffset>0x8e8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.59</name>
        <addressOffset>0x8ec</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.60</name>
        <addressOffset>0x8f0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.61</name>
        <addressOffset>0x8f4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.62</name>
        <addressOffset>0x8f8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.63</name>
        <addressOffset>0x8fc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.64</name>
        <addressOffset>0x900</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.65</name>
        <addressOffset>0x904</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.66</name>
        <addressOffset>0x908</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.67</name>
        <addressOffset>0x90c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.68</name>
        <addressOffset>0x910</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.69</name>
        <addressOffset>0x914</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.70</name>
        <addressOffset>0x918</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.71</name>
        <addressOffset>0x91c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.72</name>
        <addressOffset>0x920</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.73</name>
        <addressOffset>0x924</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.74</name>
        <addressOffset>0x928</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.75</name>
        <addressOffset>0x92c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.76</name>
        <addressOffset>0x930</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.77</name>
        <addressOffset>0x934</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.78</name>
        <addressOffset>0x938</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.79</name>
        <addressOffset>0x93c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.80</name>
        <addressOffset>0x940</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.81</name>
        <addressOffset>0x944</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.82</name>
        <addressOffset>0x948</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.83</name>
        <addressOffset>0x94c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.84</name>
        <addressOffset>0x950</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.85</name>
        <addressOffset>0x954</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.86</name>
        <addressOffset>0x958</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.87</name>
        <addressOffset>0x95c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.88</name>
        <addressOffset>0x960</addressOffset>
        <size>0x20</size>
      </register>
