modm-ext/archive-stmicro-svd/rm_rm0432_stm32l4p5aei6.svd
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.155</name>
        <addressOffset>0xa6c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.156</name>
        <addressOffset>0xa70</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.157</name>
        <addressOffset>0xa74</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.158</name>
        <addressOffset>0xa78</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.159</name>
        <addressOffset>0xa7c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.160</name>
        <addressOffset>0xa80</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.161</name>
        <addressOffset>0xa84</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.162</name>
        <addressOffset>0xa88</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.163</name>
        <addressOffset>0xa8c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.164</name>
        <addressOffset>0xa90</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.165</name>
        <addressOffset>0xa94</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.166</name>
        <addressOffset>0xa98</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.167</name>
        <addressOffset>0xa9c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.168</name>
        <addressOffset>0xaa0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.169</name>
        <addressOffset>0xaa4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.170</name>
        <addressOffset>0xaa8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.171</name>
        <addressOffset>0xaac</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.172</name>
        <addressOffset>0xab0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.173</name>
        <addressOffset>0xab4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.174</name>
        <addressOffset>0xab8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.175</name>
        <addressOffset>0xabc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.176</name>
        <addressOffset>0xac0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.177</name>
        <addressOffset>0xac4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.178</name>
        <addressOffset>0xac8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.179</name>
        <addressOffset>0xacc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.180</name>
        <addressOffset>0xad0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.181</name>
        <addressOffset>0xad4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.182</name>
        <addressOffset>0xad8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.183</name>
        <addressOffset>0xadc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.184</name>
        <addressOffset>0xae0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.185</name>
        <addressOffset>0xae4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.186</name>
        <addressOffset>0xae8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.187</name>
        <addressOffset>0xaec</addressOffset>
        <size>0x20</size>
      </register>
