modm-ext/archive-stmicro-svd/rm_rm0432_stm32l4p5aei6.svd
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.188</name>
        <addressOffset>0xaf0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.189</name>
        <addressOffset>0xaf4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.190</name>
        <addressOffset>0xaf8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.191</name>
        <addressOffset>0xafc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.192</name>
        <addressOffset>0xb00</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.193</name>
        <addressOffset>0xb04</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.194</name>
        <addressOffset>0xb08</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.195</name>
        <addressOffset>0xb0c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.196</name>
        <addressOffset>0xb10</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.197</name>
        <addressOffset>0xb14</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.198</name>
        <addressOffset>0xb18</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.199</name>
        <addressOffset>0xb1c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.200</name>
        <addressOffset>0xb20</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.201</name>
        <addressOffset>0xb24</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.202</name>
        <addressOffset>0xb28</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.203</name>
        <addressOffset>0xb2c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.204</name>
        <addressOffset>0xb30</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.205</name>
        <addressOffset>0xb34</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.206</name>
        <addressOffset>0xb38</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.207</name>
        <addressOffset>0xb3c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.208</name>
        <addressOffset>0xb40</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.209</name>
        <addressOffset>0xb44</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.210</name>
        <addressOffset>0xb48</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.211</name>
        <addressOffset>0xb4c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.212</name>
        <addressOffset>0xb50</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.213</name>
        <addressOffset>0xb54</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.214</name>
        <addressOffset>0xb58</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.215</name>
        <addressOffset>0xb5c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.216</name>
        <addressOffset>0xb60</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.217</name>
        <addressOffset>0xb64</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.218</name>
        <addressOffset>0xb68</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.219</name>
        <addressOffset>0xb6c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE&lt;y&gt;</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>GREEN&lt;y&gt;</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>RED&lt;y&gt;</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>ALPHA&lt;y&gt;</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCLUT.220</name>
        <addressOffset>0xb70</addressOffset>
        <size>0x20</size>
      </register>
